---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralSectionLangleBoltDiameterShorterFlange
source: html/74fd2288-34d7-3e1c-a919-2907c7c7826a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralSectionLangleBoltDiameterShorterFlange Property

"Bolt Diameter Shorter Flange"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralSectionLangleBoltDiameterShorterFlange { get; }
```